Gatling/2017-10-16_12-40-08.965137/gatling-stdout.log
GATLING_HOME is set to /Users/daper01/.bzt/gatling-taurus/2.2.4
12:50:56.802 [WARN ] i.g.c.ZincCompiler$ - Pruning sources from previous analysis, due to incompatible CompileSetup.
12:51:01.759 [ERROR] i.g.c.c.GatlingConfiguration$ - Your gatling.conf file is outdated, some properties have been renamed or removed.
Please update (check gatling.conf in Gatling bundle, or gatling-defaults.conf in gatling-core jar).
Enabled obsolete properties:
'gatling.http.ahc.allowPoolingSslConnections' was removed, dropped.
'gatling.http.ahc.allowPoolingConnections' was renamed into gatling.http.ahc.keepAlive.
Simulation BlazeDemo started...

================================================================================
2017-10-16 12:51:07                                           5s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=7      KO=0     )
> request_0                                                (OK=7      KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[-                                                                         ]  0%
          waiting: 6092   / active: 1      / done:7     
================================================================================


================================================================================
2017-10-16 12:51:12                                          10s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=15     KO=0     )
> request_0                                                (OK=15     KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[-                                                                         ]  0%
          waiting: 6084   / active: 1      / done:15    
================================================================================


================================================================================
2017-10-16 12:51:17                                          15s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=24     KO=0     )
> request_0                                                (OK=24     KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[-                                                                         ]  0%
          waiting: 6075   / active: 1      / done:24    
================================================================================


================================================================================
2017-10-16 12:51:22                                          20s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=32     KO=0     )
> request_0                                                (OK=32     KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[-                                                                         ]  0%
          waiting: 6067   / active: 1      / done:32    
================================================================================


================================================================================
2017-10-16 12:51:27                                          25s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=40     KO=0     )
> request_0                                                (OK=40     KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[-                                                                         ]  0%
          waiting: 6059   / active: 1      / done:40    
================================================================================


================================================================================
2017-10-16 12:51:32                                          30s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=49     KO=0     )
> request_0                                                (OK=49     KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[-                                                                         ]  0%
          waiting: 6050   / active: 1      / done:49    
================================================================================


================================================================================
2017-10-16 12:51:37                                          35s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=57     KO=0     )
> request_0                                                (OK=57     KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[-                                                                         ]  0%
          waiting: 6042   / active: 1      / done:57    
================================================================================


================================================================================
2017-10-16 12:51:42                                          40s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=65     KO=0     )
> request_0                                                (OK=65     KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[-                                                                         ]  1%
          waiting: 6034   / active: 1      / done:65    
================================================================================


================================================================================
2017-10-16 12:51:47                                          45s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=74     KO=0     )
> request_0                                                (OK=74     KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[-                                                                         ]  1%
          waiting: 6025   / active: 1      / done:74    
================================================================================


================================================================================
2017-10-16 12:51:52                                          50s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=82     KO=0     )
> request_0                                                (OK=82     KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[-                                                                         ]  1%
          waiting: 6017   / active: 1      / done:82    
================================================================================


================================================================================
2017-10-16 12:51:57                                          55s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=90     KO=0     )
> request_0                                                (OK=90     KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[#-                                                                        ]  1%
          waiting: 6009   / active: 1      / done:90    
================================================================================


================================================================================
2017-10-16 12:52:02                                          60s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=99     KO=0     )
> request_0                                                (OK=99     KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[#-                                                                        ]  1%
          waiting: 6000   / active: 1      / done:99    
================================================================================


================================================================================
2017-10-16 12:52:07                                          65s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=458    KO=0     )
> request_0                                                (OK=458    KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[#####-                                                                    ]  7%
          waiting: 5592   / active: 50     / done:458   
================================================================================


================================================================================
2017-10-16 12:52:12                                          70s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=972    KO=0     )
> request_0                                                (OK=972    KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[###########-                                                              ] 15%
          waiting: 5092   / active: 36     / done:972   
================================================================================


================================================================================
2017-10-16 12:52:17                                          75s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=1476   KO=0     )
> request_0                                                (OK=1476   KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[#################-                                                        ] 24%
          waiting: 4592   / active: 32     / done:1476  
================================================================================


================================================================================
2017-10-16 12:52:22                                          80s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=1967   KO=0     )
> request_0                                                (OK=1967   KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[#######################-                                                  ] 32%
          waiting: 4092   / active: 41     / done:1967  
================================================================================


================================================================================
2017-10-16 12:52:27                                          85s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=2466   KO=0     )
> request_0                                                (OK=2466   KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[#############################-                                            ] 40%
          waiting: 3592   / active: 42     / done:2466  
================================================================================


================================================================================
2017-10-16 12:52:32                                          90s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=2958   KO=0     )
> request_0                                                (OK=2958   KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[###################################-                                      ] 48%
          waiting: 3092   / active: 50     / done:2958  
================================================================================


================================================================================
2017-10-16 12:52:37                                          95s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=3467   KO=0     )
> request_0                                                (OK=3467   KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[##########################################-                               ] 56%
          waiting: 2592   / active: 41     / done:3467  
================================================================================


================================================================================
2017-10-16 12:52:42                                         100s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=3957   KO=0     )
> request_0                                                (OK=3957   KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[################################################-                         ] 64%
          waiting: 2092   / active: 51     / done:3957  
================================================================================


================================================================================
2017-10-16 12:52:47                                         105s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=4460   KO=0     )
> request_0                                                (OK=4460   KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[######################################################-                   ] 73%
          waiting: 1592   / active: 48     / done:4460  
================================================================================


================================================================================
2017-10-16 12:52:52                                         110s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=4969   KO=0     )
> request_0                                                (OK=4969   KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[############################################################-             ] 81%
          waiting: 1092   / active: 39     / done:4969  
================================================================================


================================================================================
2017-10-16 12:52:57                                         115s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=5469   KO=0     )
> request_0                                                (OK=5469   KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[##################################################################-       ] 89%
          waiting: 592    / active: 39     / done:5469  
================================================================================


================================================================================
2017-10-16 12:53:02                                         120s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=5970   KO=0     )
> request_0                                                (OK=5970   KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[########################################################################- ] 97%
          waiting: 92     / active: 38     / done:5970  
================================================================================


================================================================================
2017-10-16 12:53:04                                         122s elapsed
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=6100   KO=0     )
> request_0                                                (OK=6100   KO=0     )

---- BlazeDemo -----------------------------------------------------------------
[##########################################################################]100%
          waiting: 0      / active: 0      / done:6100  
================================================================================

Simulation BlazeDemo completed in 121 seconds
Parsing log file(s)...
Parsing log file(s) done
Generating reports...

================================================================================
---- Global Information --------------------------------------------------------
> request count                                       6100 (OK=6100   KO=0     )
> min response time                                    221 (OK=221    KO=-     )
> max response time                                  25774 (OK=25774  KO=-     )
> mean response time                                   418 (OK=418    KO=-     )
> std deviation                                        474 (OK=474    KO=-     )
> response time 50th percentile                        342 (OK=342    KO=-     )
> response time 75th percentile                        392 (OK=392    KO=-     )
> response time 95th percentile                        867 (OK=867    KO=-     )
> response time 99th percentile                       1568 (OK=1568   KO=-     )
> mean requests/sec                                     50 (OK=50     KO=-     )
---- Response Time Distribution ------------------------------------------------
> t < 800 ms                                          5630 ( 92%)
> 800 ms < t < 1200 ms                                 266 (  4%)
> t > 1200 ms                                          204 (  3%)
> failed                                                 0 (  0%)
================================================================================

Reports generated in 1s.
Please open the following file: /Users/daper01/Documents/OSLo/Gatling/2017-10-16_12-40-08.965137/gatling-4515409360-1508172662319/index.html